tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1717_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1717_H_
#define _PIC16LF1717_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define RA6                           42
#define RA7                           43
#define PORTB                         44
#define RB0                           45
#define RB1                           46
#define RB2                           47
#define RB3                           48
#define RB4                           49
#define RB5                           50
#define RB6                           51
#define RB7                           52
#define PORTC                         53
#define RC0                           54
#define RC1                           55
#define RC2                           56
#define RC3                           57
#define RC4                           58
#define RC5                           59
#define RC6                           60
#define RC7                           61
#define PORTD                         62
#define RD0                           63
#define RD1                           64
#define RD2                           65
#define RD3                           66
#define RD4                           67
#define RD5                           68
#define RD6                           69
#define RD7                           70
#define PORTE                         71
#define RE0                           72
#define RE1                           73
#define RE2                           74
#define RE3                           75
#define PIR1                          76
#define TMR1IF                        77
#define TMR2IF                        78
#define CCP1IF                        79
#define SSP1IF                        80
#define TXIF                          81
#define RCIF                          82
#define ADIF                          83
#define TMR1GIF                       84
#define PIR2                          85
#define CCP2IF                        86
#define TMR4IF                        87
#define TMR6IF                        88
#define BCL1IF                        89
#define C1IF                          90
#define C2IF                          91
#define OSFIF                         92
#define PIR3                          93
#define CLC1IF                        94
#define CLC2IF                        95
#define CLC3IF                        96
#define CLC4IF                        97
#define ZCDIF                         98
#define COGIF                         99
#define NCOIF                         100
#define TMR0                          101
#define TMR1L                         102
#define TMR1H                         103
#define T1CON                         104
#define TMR1ON                        105
#define nT1SYNC                       106
#define T1OSCEN                       107
#define T1CKPS0                       108
#define T1CKPS                        109
#define T1CKPS1                       110
#define TMR1CS0                       111
#define TMR1CS                        112
#define TMR1CS1                       113
#define T1GCON                        114
#define T1GSS0                        115
#define T1GSS                         116
#define T1GSS1                        117
#define T1GVAL                        118
#define T1GGO_nDONE                   119
#define T1GSPM                        120
#define T1GTM                         121
#define T1GPOL                        122
#define TMR1GE                        123
#define TMR2                          124
#define PR2                           125
#define T2CON                         126
#define T2CKPS0                       127
#define T2CKPS                        128
#define T2CKPS1                       129
#define TMR2ON                        130
#define T2OUTPS0                      131
#define T2OUTPS                       132
#define T2OUTPS1                      133
#define T2OUTPS2                      134
#define T2OUTPS3                      135
#define TRISA                         136
#define TRISA0                        137
#define TRISA1                        138
#define TRISA2                        139
#define TRISA3                        140
#define TRISA4                        141
#define TRISA5                        142
#define TRISA6                        143
#define TRISA7                        144
#define TRISB                         145
#define TRISB0                        146
#define TRISB1                        147
#define TRISB2                        148
#define TRISB3                        149
#define TRISB4                        150
#define TRISB5                        151
#define TRISB6                        152
#define TRISB7                        153
#define TRISC                         154
#define TRISC0                        155
#define TRISC1                        156
#define TRISC2                        157
#define TRISC3                        158
#define TRISC4                        159
#define TRISC5                        160
#define TRISC6                        161
#define TRISC7                        162
#define TRISD                         163
#define TRISD0                        164
#define TRISD1                        165
#define TRISD2                        166
#define TRISD3                        167
#define TRISD4                        168
#define TRISD5                        169
#define TRISD6                        170
#define TRISD7                        171
#define TRISE                         172
#define TRISE0                        173
#define TRISE1                        174
#define TRISE2                        175
#define TRISE3                        176
#define PIE1                          177
#define TMR1IE                        178
#define TMR2IE                        179
#define CCP1IE                        180
#define SSP1IE                        181
#define TXIE                          182
#define RCIE                          183
#define ADIE                          184
#define TMR1GIE                       185
#define PIE2                          186
#define CCP2IE                        187
#define TMR4IE                        188
#define TMR6IE                        189
#define BCL1IE                        190
#define C1IE                          191
#define C2IE                          192
#define OSFIE                         193
#define PIE3                          194
#define CLC1IE                        195
#define CLC2IE                        196
#define CLC3IE                        197
#define CLC4IE                        198
#define ZCDIE                         199
#define COGIE                         200
#define NCOIE                         201
#define OPTION_REG                    202
#define PS                            203
#define PS0                           204
#define PS1                           205
#define PS2                           206
#define PSA                           207
#define T0SE                          208
#define TMR0SE                        209
#define T0CS                          210
#define TMR0CS                        211
#define INTEDG                        212
#define nWPUEN                        213
#define PCON                          214
#define nBOR                          215
#define nPOR                          216
#define nRI                           217
#define nRMCLR                        218
#define nRWDT                         219
#define STKUNF                        220
#define STKOVF                        221
#define WDTCON                        222
#define SWDTEN                        223
#define WDTPS                         224
#define WDTPS0                        225
#define WDTPS1                        226
#define WDTPS2                        227
#define WDTPS3                        228
#define WDTPS4                        229
#define OSCTUNE                       230
#define TUN0                          231
#define TUN                           232
#define TUN1                          233
#define TUN2                          234
#define TUN3                          235
#define TUN4                          236
#define TUN5                          237
#define OSCCON                        238
#define SCS0                          239
#define SCS                           240
#define SCS1                          241
#define IRCF                          242
#define IRCF0                         243
#define IRCF1                         244
#define IRCF2                         245
#define IRCF3                         246
#define SPLLEN                        247
#define OSCSTAT                       248
#define HFIOFS                        249
#define LFIOFR                        250
#define MFIOFR                        251
#define HFIOFL                        252
#define HFIOFR                        253
#define OSTS                          254
#define PLLR                          255
#define SOSCR                         256
#define ADRESL                        257
#define ADRESH                        258
#define ADCON0                        259
#define ADON                          260
#define GO_nDONE                      261
#define GO                            262
#define ADGO                          263
#define CHS0                          264
#define CHS                           265
#define CHS1                          266
#define CHS2                          267
#define CHS3                          268
#define CHS4                          269
#define ADCON1                        270
#define ADPREF0                       271
#define ADPREF                        272
#define ADPREF1                       273
#define ADNREF                        274
#define ADCS                          275
#define ADFM                          276
#define ADCON2                        277
#define TRIGSEL                       278
#define TRIGSEL0                      279
#define TRIGSEL1                      280
#define TRIGSEL2                      281
#define TRIGSEL3                      282
#define LATA                          283
#define LATA0                         284
#define LATA1                         285
#define LATA2                         286
#define LATA3                         287
#define LATA4                         288
#define LATA5                         289
#define LATA6                         290
#define LATA7                         291
#define LATB                          292
#define LATB0                         293
#define LATB1                         294
#define LATB2                         295
#define LATB3                         296
#define LATB4                         297
#define LATB5                         298
#define LATB6                         299
#define LATB7                         300
#define LATC                          301
#define LATC0                         302
#define LATC1                         303
#define LATC2                         304
#define LATC3                         305
#define LATC4                         306
#define LATC5                         307
#define LATC6                         308
#define LATC7                         309
#define LATD                          310
#define LATD0                         311
#define LATD1                         312
#define LATD2                         313
#define LATD3                         314
#define LATD4                         315
#define LATD5                         316
#define LATD6                         317
#define LATD7                         318
#define LATE                          319
#define LATE0                         320
#define LATE1                         321
#define LATE2                         322
#define CM1CON0                       323
#define C1SYNC                        324
#define C1HYS                         325
#define C1SP                          326
#define C1ZLF                         327
#define C1POL                         328
#define C1OUT                         329
#define C1ON                          330
#define CM1CON1                       331
#define C1NCH0                        332
#define C1NCH                         333
#define C1NCH1                        334
#define C1NCH2                        335
#define C1PCH                         336
#define C1PCH0                        337
#define C1PCH1                        338
#define C1PCH2                        339
#define C1INTN                        340
#define C1INTP                        341
#define CM2CON0                       342
#define C2SYNC                        343
#define C2HYS                         344
#define C2SP                          345
#define C2ZLF                         346
#define C2POL                         347
#define C2OUT                         348
#define C2ON                          349
#define CM2CON1                       350
#define C2NCH0                        351
#define C2NCH                         352
#define C2NCH1                        353
#define C2NCH2                        354
#define C2PCH                         355
#define C2PCH0                        356
#define C2PCH1                        357
#define C2PCH2                        358
#define C2INTN                        359
#define C2INTP                        360
#define CMOUT                         361
#define MC1OUT                        362
#define MC2OUT                        363
#define BORCON                        364
#define BORRDY                        365
#define BORFS                         366
#define SBOREN                        367
#define FVRCON                        368
#define ADFVR0                        369
#define ADFVR                         370
#define ADFVR1                        371
#define CDAFVR                        372
#define CDAFVR0                       373
#define CDAFVR1                       374
#define TSRNG                         375
#define TSEN                          376
#define FVRRDY                        377
#define FVREN                         378
#define DAC1CON0                      379
#define DAC1CON0_DACNSS               380
#define DAC1NSS                       381
#define DAC1PSS                       382
#define DAC1CON0_DACPSS               383
#define DAC1CON0_DACPSS0              384
#define DAC1PSS0                      385
#define DAC1CON0_DACPSS1              386
#define DAC1PSS1                      387
#define DACOE0                        388
#define DAC1OE2                       389
#define DAC1OE1                       390
#define DAC1CON0_DACOE1               391
#define DAC1CON0_DACEN                392
#define DAC1EN                        393
#define DAC1CON1                      394
#define DAC1R                         395
#define DAC1R0                        396
#define DAC1CON1_DACR0                397
#define DAC1R1                        398
#define DAC1CON1_DACR1                399
#define DAC1R2                        400
#define DAC1CON1_DACR2                401
#define DAC1R3                        402
#define DAC1CON1_DACR3                403
#define DAC1R4                        404
#define DAC1CON1_DACR4                405
#define DACR5                         406
#define DAC1R5                        407
#define DACR6                         408
#define DAC1R6                        409
#define DACR7                         410
#define DAC1R7                        411
#define DAC2CON0                      412
#define DAC2CON0_DACNSS               413
#define DAC2NSS                       414
#define NSS                           415
#define DAC2CON0_DACPSS0              416
#define DAC2PSS0                      417
#define DAC2PSS                       418
#define PSS0                          419
#define DAC2CON0_DACPSS               420
#define PSS                           421
#define DAC2CON0_DACPSS1              422
#define PSS1                          423
#define DAC2PSS1                      424
#define OE2                           425
#define DACOE2                        426
#define DAC2OE2                       427
#define OE1                           428
#define DAC2CON0_DACOE1               429
#define DAC2OE1                       430
#define DAC2EN                        431
#define DAC2CON0_DACEN                432
#define DAC2CON0_EN                   433
#define DAC2REF                       434
#define DAC2REF_DACR0                 435
#define REF0                          436
#define DACR                          437
#define DAC2REF0                      438
#define R0                            439
#define DAC2R                         440
#define DAC2R0                        441
#define DAC2REF1                      442
#define REF1                          443
#define DAC2REF_DACR1                 444
#define R1                            445
#define DAC2R1                        446
#define DAC2REF2                      447
#define REF2                          448
#define DAC2REF_DACR2                 449
#define R2                            450
#define DAC2R2                        451
#define DAC2REF3                      452
#define REF3                          453
#define DAC2REF_DACR3                 454
#define R3                            455
#define DAC2R3                        456
#define REF4                          457
#define R4                            458
#define DAC2REF_DACR4                 459
#define DAC2REF4                      460
#define DAC2R4                        461
#define REF5                          462
#define DAC2REF5                      463
#define ZCD1CON                       464
#define ZCD1INTN                      465
#define ZCD1INTP                      466
#define ZCD1POL                       467
#define ZCD1OUT                       468
#define ZCD1EN                        469
#define ANSELA                        470
#define ANSA0                         471
#define ANSA1                         472
#define ANSA2                         473
#define ANSA3                         474
#define ANSA4                         475
#define ANSA5                         476
#define ANSELB                        477
#define ANSB0                         478
#define ANSB1                         479
#define ANSB2                         480
#define ANSB3                         481
#define ANSB4                         482
#define ANSB5                         483
#define ANSELC                        484
#define ANSC2                         485
#define ANSC3                         486
#define ANSC4                         487
#define ANSC5                         488
#define ANSC6                         489
#define ANSC7                         490
#define ANSELD                        491
#define ANSD0                         492
#define ANSD1                         493
#define ANSD2                         494
#define ANSD3                         495
#define ANSD4                         496
#define ANSD5                         497
#define ANSD6                         498
#define ANSD7                         499
#define ANSELE                        500
#define ANSE0                         501
#define ANSE1                         502
#define ANSE2                         503
#define PMADRL                        504
#define PMADRH                        505
#define PMDATL                        506
#define PMDATH                        507
#define PMCON1                        508
#define RD                            509
#define WR                            510
#define WREN                          511
#define WRERR                         512
#define FREE                          513
#define LWLO                          514
#define CFGS                          515
#define PMCON2                        516
#define RC1REG                        517
#define TX1REG                        518
#define SP1BRGL                       519
#define SP1BRGH                       520
#define RC1STA                        521
