tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1717_tdd.h
#define RX9D                          522
#define OERR                          523
#define FERR                          524
#define ADDEN                         525
#define CREN                          526
#define SREN                          527
#define RX9                           528
#define SPEN                          529
#define TX1STA                        530
#define TX9D                          531
#define TRMT                          532
#define BRGH                          533
#define SENDB                         534
#define SYNC                          535
#define TXEN                          536
#define TX9                           537
#define CSRC                          538
#define BAUD1CON                      539
#define ABDEN                         540
#define WUE                           541
#define BRG16                         542
#define SCKP                          543
#define RCIDL                         544
#define ABDOVF                        545
#define WPUA                          546
#define WPUA0                         547
#define WPUA1                         548
#define WPUA2                         549
#define WPUA3                         550
#define WPUA4                         551
#define WPUA5                         552
#define WPUA6                         553
#define WPUA7                         554
#define WPUB                          555
#define WPUB0                         556
#define WPUB1                         557
#define WPUB2                         558
#define WPUB3                         559
#define WPUB4                         560
#define WPUB5                         561
#define WPUB6                         562
#define WPUB7                         563
#define WPUC                          564
#define WPUC0                         565
#define WPUC1                         566
#define WPUC2                         567
#define WPUC3                         568
#define WPUC4                         569
#define WPUC5                         570
#define WPUC6                         571
#define WPUC7                         572
#define WPUD                          573
#define WPUD0                         574
#define WPUD1                         575
#define WPUD2                         576
#define WPUD3                         577
#define WPUD4                         578
#define WPUD5                         579
#define WPUD6                         580
#define WPUD7                         581
#define WPUE                          582
#define WPUE0                         583
#define WPUE1                         584
#define WPUE2                         585
#define WPUE3                         586
#define SSP1BUF                       587
#define BUF                           588
#define BUF0                          589
#define SSP1BUF0                      590
#define BUF1                          591
#define SSP1BUF1                      592
#define BUF2                          593
#define SSP1BUF2                      594
#define BUF3                          595
#define SSP1BUF3                      596
#define BUF4                          597
#define SSP1BUF4                      598
#define BUF5                          599
#define SSP1BUF5                      600
#define BUF6                          601
#define SSP1BUF6                      602
#define BUF7                          603
#define SSP1BUF7                      604
#define ADD0                          605
#define ADD                           606
#define SSP1ADD0                      607
#define SSP1ADD                       608
#define ADD1                          609
#define SSP1ADD1                      610
#define ADD2                          611
#define SSP1ADD2                      612
#define ADD3                          613
#define SSP1ADD3                      614
#define ADD4                          615
#define SSP1ADD4                      616
#define ADD5                          617
#define SSP1ADD5                      618
#define ADD6                          619
#define SSP1ADD6                      620
#define ADD7                          621
#define SSP1ADD7                      622
#define SSP1MSK0                      623
#define SSP1MSK                       624
#define MSK0                          625
#define MSK                           626
#define SSP1MSK1                      627
#define MSK1                          628
#define SSP1MSK2                      629
#define MSK2                          630
#define SSP1MSK3                      631
#define MSK3                          632
#define SSP1MSK4                      633
#define MSK4                          634
#define SSP1MSK5                      635
#define MSK5                          636
#define SSP1MSK6                      637
#define MSK6                          638
#define SSP1MSK7                      639
#define MSK7                          640
#define SSP1STAT                      641
#define BF                            642
#define UA                            643
#define R_nW                          644
#define S                             645
#define P                             646
#define D_nA                          647
#define CKE                           648
#define SMP                           649
#define SSP1CON1                      650
#define SSPM0                         651
#define SSPM                          652
#define SSPM1                         653
#define SSPM2                         654
#define SSPM3                         655
#define CKP                           656
#define SSPEN                         657
#define SSPOV                         658
#define WCOL                          659
#define SSP1CON2                      660
#define SEN                           661
#define RSEN                          662
#define PEN                           663
#define RCEN                          664
#define ACKEN                         665
#define ACKDT                         666
#define ACKSTAT                       667
#define GCEN                          668
#define SSP1CON3                      669
#define DHEN                          670
#define AHEN                          671
#define SBCDE                         672
#define SDAHT                         673
#define BOEN                          674
#define SCIE                          675
#define PCIE                          676
#define ACKTIM                        677
#define ODCONA                        678
#define ODA0                          679
#define ODA1                          680
#define ODA2                          681
#define ODA3                          682
#define ODA4                          683
#define ODA5                          684
#define ODA6                          685
#define ODA7                          686
#define ODCONB                        687
#define ODB0                          688
#define ODB1                          689
#define ODB2                          690
#define ODB3                          691
#define ODB4                          692
#define ODB5                          693
#define ODB6                          694
#define ODB7                          695
#define ODCONC                        696
#define ODC0                          697
#define ODC1                          698
#define ODC2                          699
#define ODC3                          700
#define ODC4                          701
#define ODC5                          702
#define ODC6                          703
#define ODC7                          704
#define ODCOND                        705
#define ODD0                          706
#define ODD1                          707
#define ODD2                          708
#define ODD3                          709
#define ODD4                          710
#define ODD5                          711
#define ODD6                          712
#define ODD7                          713
#define ODCONE                        714
#define ODE0                          715
#define ODE1                          716
#define ODE2                          717
#define CCPR1L                        718
#define CCPR1H                        719
#define CCP1CON                       720
#define CCP1M0                        721
#define CCP1M                         722
#define CCP1M1                        723
#define CCP1M2                        724
#define CCP1M3                        725
#define CCP1Y                         726
#define DC1B                          727
#define DC1B0                         728
#define CCP1X                         729
#define DC1B1                         730
#define CCPR2L                        731
#define CCPR2H                        732
#define CCP2CON                       733
#define CCP2M                         734
#define CCP2M0                        735
#define CCP2M1                        736
#define CCP2M2                        737
#define CCP2M3                        738
#define DC2B0                         739
#define CCP2Y                         740
#define DC2B                          741
#define DC2B1                         742
#define CCP2X                         743
#define CCPTMRS                       744
#define C1TSEL0                       745
#define C1TSEL                        746
#define C1TSEL1                       747
#define C2TSEL0                       748
#define C2TSEL                        749
#define C2TSEL1                       750
#define P3TSEL                        751
#define P3TSEL0                       752
#define P3TSEL1                       753
#define P4TSEL0                       754
#define P4TSEL                        755
#define P4TSEL1                       756
#define SLRCONA                       757
#define SLRA0                         758
#define SLRA1                         759
#define SLRA2                         760
#define SLRA3                         761
#define SLRA4                         762
#define SLRA5                         763
#define SLRA6                         764
#define SLRA7                         765
#define SLRCONB                       766
#define SLRB0                         767
#define SLRB1                         768
#define SLRB2                         769
#define SLRB3                         770
#define SLRB4                         771
#define SLRB5                         772
#define SLRB6                         773
#define SLRB7                         774
#define SLRCONC                       775
#define SLRC0                         776
#define SLRC1                         777
#define SLRC2                         778
#define SLRC3                         779
#define SLRC4                         780
#define SLRC5                         781
#define SLRC6                         782
#define SLRC7                         783
#define SLRCOND                       784
#define SLRD0                         785
#define SLRD1                         786
#define SLRD2                         787
#define SLRD3                         788
#define SLRD4                         789
#define SLRD5                         790
#define SLRD6                         791
#define SLRD7                         792
#define SLRCONE                       793
#define SLRE0                         794
#define SLRE1                         795
#define SLRE2                         796
#define INLVLA                        797
#define INLVLA0                       798
#define INLVLA1                       799
#define INLVLA2                       800
#define INLVLA3                       801
#define INLVLA4                       802
#define INLVLA5                       803
#define INLVLA6                       804
#define INLVLA7                       805
#define INLVLB                        806
#define INLVLB0                       807
#define INLVLB1                       808
#define INLVLB2                       809
#define INLVLB3                       810
#define INLVLB4                       811
#define INLVLB5                       812
#define INLVLB6                       813
#define INLVLB7                       814
#define INLVLC                        815
#define INLVLC0                       816
#define INLVLC1                       817
#define INLVLC2                       818
#define INLVLC3                       819
#define INLVLC4                       820
#define INLVLC5                       821
#define INLVLC6                       822
#define INLVLC7                       823
#define INLVLD                        824
#define INLVLD0                       825
#define INLVLD1                       826
#define INLVLD2                       827
#define INLVLD3                       828
#define INLVLD4                       829
#define INLVLD5                       830
#define INLVLD6                       831
#define INLVLD7                       832
#define INLVLE                        833
#define INLVLE0                       834
#define INLVLE1                       835
#define INLVLE2                       836
#define INLVLE3                       837
#define IOCAP                         838
#define IOCAP0                        839
#define IOCAP1                        840
#define IOCAP2                        841
#define IOCAP3                        842
#define IOCAP4                        843
#define IOCAP5                        844
#define IOCAP6                        845
#define IOCAP7                        846
#define IOCAN                         847
#define IOCAN0                        848
#define IOCAN1                        849
#define IOCAN2                        850
#define IOCAN3                        851
#define IOCAN4                        852
#define IOCAN5                        853
#define IOCAN6                        854
#define IOCAN7                        855
#define IOCAF                         856
#define IOCAF0                        857
#define IOCAF1                        858
#define IOCAF2                        859
#define IOCAF3                        860
#define IOCAF4                        861
#define IOCAF5                        862
#define IOCAF6                        863
#define IOCAF7                        864
#define IOCBP                         865
#define IOCBP0                        866
#define IOCBP1                        867
#define IOCBP2                        868
#define IOCBP3                        869
#define IOCBP4                        870
#define IOCBP5                        871
#define IOCBP6                        872
#define IOCBP7                        873
#define IOCBN                         874
#define IOCBN0                        875
#define IOCBN1                        876
#define IOCBN2                        877
#define IOCBN3                        878
#define IOCBN4                        879
#define IOCBN5                        880
#define IOCBN6                        881
#define IOCBN7                        882
#define IOCBF                         883
#define IOCBF0                        884
#define IOCBF1                        885
#define IOCBF2                        886
#define IOCBF3                        887
#define IOCBF4                        888
#define IOCBF5                        889
#define IOCBF6                        890
#define IOCBF7                        891
#define IOCCP                         892
#define IOCCP0                        893
#define IOCCP1                        894
#define IOCCP2                        895
#define IOCCP3                        896
#define IOCCP4                        897
#define IOCCP5                        898
#define IOCCP6                        899
#define IOCCP7                        900
#define IOCCN                         901
#define IOCCN0                        902
#define IOCCN1                        903
#define IOCCN2                        904
#define IOCCN3                        905
#define IOCCN4                        906
#define IOCCN5                        907
#define IOCCN6                        908
#define IOCCN7                        909
#define IOCCF                         910
#define IOCCF0                        911
#define IOCCF1                        912
#define IOCCF2                        913
#define IOCCF3                        914
#define IOCCF4                        915
#define IOCCF5                        916
#define IOCCF6                        917
#define IOCCF7                        918
#define IOCEP                         919
#define IOCEP3                        920
#define IOCEN                         921
#define IOCEN3                        922
#define IOCEF                         923
#define IOCEF3                        924
#define TMR4                          925
#define PR4                           926
#define T4CON                         927
#define T4CKPS0                       928
#define T4CKPS                        929
#define T4CKPS1                       930
#define TMR4ON                        931
#define T4OUTPS                       932
#define T4OUTPS0                      933
#define T4OUTPS1                      934
#define T4OUTPS2                      935
#define T4OUTPS3                      936
#define TMR6                          937
#define PR6                           938
#define T6CON                         939
#define T6CKPS0                       940
#define T6CKPS                        941
#define T6CKPS1                       942
#define TMR6ON                        943
#define T6OUTPS0                      944
#define T6OUTPS                       945
#define T6OUTPS1                      946
#define T6OUTPS2                      947
#define T6OUTPS3                      948
#define NCO1ACCL                      949
#define NCO1ACCL_NCO1ACC              950
#define NCO1ACC0                      951
#define NCO1ACC1                      952
#define NCO1ACC2                      953
#define NCO1ACC3                      954
#define NCO1ACC4                      955
#define NCO1ACC5                      956
#define NCO1ACC6                      957
#define NCO1ACC7                      958
#define NCO1ACCH                      959
#define NCO1ACC8                      960
#define NCO1ACCH_NCO1ACC              961
#define NCO1ACC9                      962
#define NCO1ACC10                     963
#define NCO1ACC11                     964
#define NCO1ACC12                     965
#define NCO1ACC13                     966
#define NCO1ACC14                     967
#define NCO1ACC15                     968
#define NCO1ACCU                      969
#define NCO1ACCU_NCO1ACC              970
#define NCO1ACC16                     971
#define NCO1ACC17                     972
#define NCO1ACC18                     973
#define NCO1ACC19                     974
#define NCO1INCL                      975
#define NCO1INC0                      976
#define NCO1INCL_NCO1INC              977
#define NCO1INC1                      978
#define NCO1INC2                      979
#define NCO1INC3                      980
#define NCO1INC4                      981
#define NCO1INC5                      982
#define NCO1INC6                      983
#define NCO1INC7                      984
#define NCO1INCH                      985
#define NCO1INCH_NCO1INC              986
#define NCO1INC8                      987
#define NCO1INC9                      988
#define NCO1INC10                     989
#define NCO1INC11                     990
#define NCO1INC12                     991
#define NCO1INC13                     992
#define NCO1INC14                     993
#define NCO1INC15                     994
#define NCO1INCU                      995
#define NCO1INC16                     996
#define NCO1INCU_NCO1INC              997
#define NCO1INC17                     998
#define NCO1INC18                     999
#define NCO1INC19                     1000
#define NCO1CON                       1001
#define N1PFM                         1002
#define N1POL                         1003
#define N1OUT                         1004
#define N1EN                          1005
#define NCO1CLK                       1006
#define N1CKS                         1007
#define N1CKS0                        1008
#define N1CKS1                        1009
#define N1PWS0                        1010
#define N1PWS                         1011
#define N1PWS1                        1012
#define N1PWS2                        1013
#define OPA1CON                       1014
#define OPA1PCH                       1015
#define OPA1PCH0                      1016
#define OPA1PCH1                      1017
#define OPA1UG                        1018
#define OPA1SP                        1019
#define OPA1EN                        1020
#define OPA2CON                       1021
#define OPA2PCH                       1022
#define OPA2PCH0                      1023
#define OPA2PCH1                      1024
#define OPA2UG                        1025
#define OPA2SP                        1026
#define OPA2EN                        1027
#define PWM3DCL0                      1028
#define PWM3DCL                       1029
#define PWM3DCL1                      1030
#define PWM3DCH0                      1031
#define PWM3DCH                       1032
#define PWM3DCH1                      1033
#define PWM3DCH2                      1034
#define PWM3DCH3                      1035
#define PWM3DCH4                      1036
#define PWM3DCH5                      1037
#define PWM3DCH6                      1038
#define PWM3DCH7                      1039
#define PWM3CON                       1040
#define PWM3POL                       1041
#define PWM3OUT                       1042
#define PWM3EN                        1043
#define PWM4DCL                       1044
#define PWM4DCL0                      1045
#define PWM4DCL1                      1046
#define PWM4DCH0                      1047
#define PWM4DCH                       1048
#define PWM4DCH1                      1049
#define PWM4DCH2                      1050
#define PWM4DCH3                      1051
#define PWM4DCH4                      1052
#define PWM4DCH5                      1053
#define PWM4DCH6                      1054
#define PWM4DCH7                      1055
#define PWM4CON                       1056
#define PWM4POL                       1057
#define PWM4OUT                       1058
#define PWM4EN                        1059
#define COG1PHR                       1060
#define G1PHR                         1061
#define G1PHR0                        1062
#define G1PHR1                        1063
#define G1PHR2                        1064
#define G1PHR3                        1065
#define G1PHR4                        1066
#define G1PHR5                        1067
#define COG1PHF                       1068
#define G1PHF0                        1069
#define G1PHF                         1070
#define G1PHF1                        1071
#define G1PHF2                        1072
#define G1PHF3                        1073
#define G1PHF4                        1074
#define G1PHF5                        1075
#define COG1BLKR                      1076
#define G1BLKR                        1077
#define G1BLKR0                       1078
#define G1BLKR1                       1079
#define G1BLKR2                       1080
#define G1BLKR3                       1081
#define G1BLKR4                       1082
#define G1BLKR5                       1083
#define COG1BLKF                      1084
#define G1BLKF                        1085
#define G1BLKF0                       1086
#define G1BLKF1                       1087
#define G1BLKF2                       1088
#define G1BLKF3                       1089
#define G1BLKF4                       1090
