tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1717_tdd.h
#define G1BLKF5                       1091
#define COG1DBR                       1092
#define G1DBR0                        1093
#define G1DBR                         1094
#define G1DBR1                        1095
#define G1DBR2                        1096
#define G1DBR3                        1097
#define G1DBR4                        1098
#define G1DBR5                        1099
#define COG1DBF                       1100
#define G1DBF0                        1101
#define G1DBF                         1102
#define G1DBF1                        1103
#define G1DBF2                        1104
#define G1DBF3                        1105
#define G1DBF4                        1106
#define G1DBF5                        1107
#define COG1CON0                      1108
#define G1MD0                         1109
#define G1MD                          1110
#define G1MD1                         1111
#define G1MD2                         1112
#define G1CS0                         1113
#define G1CS                          1114
#define G1CS1                         1115
#define G1LD                          1116
#define G1EN                          1117
#define COG1CON1                      1118
#define G1POLA                        1119
#define G1POLB                        1120
#define G1POLC                        1121
#define G1POLD                        1122
#define G1FDBS                        1123
#define G1RDBS                        1124
#define COG1RIS                       1125
#define G1RIS0                        1126
#define G1RIS1                        1127
#define G1RIS2                        1128
#define G1RIS3                        1129
#define G1RIS4                        1130
#define G1RIS5                        1131
#define G1RIS6                        1132
#define G1RIS7                        1133
#define COG1RSIM                      1134
#define G1RSIM0                       1135
#define G1RSIM1                       1136
#define G1RSIM2                       1137
#define G1RSIM3                       1138
#define G1RSIM4                       1139
#define G1RSIM5                       1140
#define G1RSIM6                       1141
#define G1RSIM7                       1142
#define COG1FIS                       1143
#define G1FIS0                        1144
#define G1FIS1                        1145
#define G1FIS2                        1146
#define G1FIS3                        1147
#define G1FIS4                        1148
#define G1FIS5                        1149
#define G1FIS6                        1150
#define G1FIS7                        1151
#define COG1FSIM                      1152
#define G1FSIM0                       1153
#define G1FSIM1                       1154
#define G1FSIM2                       1155
#define G1FSIM3                       1156
#define G1FSIM4                       1157
#define G1FSIM5                       1158
#define G1FSIM6                       1159
#define G1FSIM7                       1160
#define COG1ASD0                      1161
#define G1ASDAC0                      1162
#define G1ASDAC                       1163
#define G1ASDAC1                      1164
#define G1ASDBD0                      1165
#define G1ASDBD                       1166
#define G1ASDBD1                      1167
#define G1ARSEN                       1168
#define G1ASE                         1169
#define COG1ASD1                      1170
#define G1AS0E                        1171
#define G1AS1E                        1172
#define G1AS2E                        1173
#define G1AS3E                        1174
#define COG1STR                       1175
#define G1STRA                        1176
#define G1STRB                        1177
#define G1STRC                        1178
#define G1STRD                        1179
#define G1SDATA                       1180
#define G1SDATB                       1181
#define G1SDATC                       1182
#define G1SDATD                       1183
#define PPSLOCK                       1184
#define PPSLOCKED                     1185
#define INTPPS                        1186
#define T0CKIPPS                      1187
#define T1CKIPPS                      1188
#define T1GPPS                        1189
#define CCP1PPS                       1190
#define CCP2PPS                       1191
#define COGINPPS                      1192
#define SSPCLKPPS                     1193
#define SSPDATPPS                     1194
#define SSPSSPPS                      1195
#define RXPPS                         1196
#define CKPPS                         1197
#define CLCIN0PPS                     1198
#define CLCIN1PPS                     1199
#define CLCIN2PPS                     1200
#define CLCIN3PPS                     1201
#define RA0PPS                        1202
#define RA1PPS                        1203
#define RA2PPS                        1204
#define RA3PPS                        1205
#define RA4PPS                        1206
#define RA5PPS                        1207
#define RA6PPS                        1208
#define RA7PPS                        1209
#define RB0PPS                        1210
#define RB1PPS                        1211
#define RB2PPS                        1212
#define RB3PPS                        1213
#define RB4PPS                        1214
#define RB5PPS                        1215
#define RB6PPS                        1216
#define RB7PPS                        1217
#define RC0PPS                        1218
#define RC1PPS                        1219
#define RC2PPS                        1220
#define RC3PPS                        1221
#define RC4PPS                        1222
#define RC5PPS                        1223
#define RC6PPS                        1224
#define RC7PPS                        1225
#define RD0PPS                        1226
#define RD1PPS                        1227
#define RD2PPS                        1228
#define RD3PPS                        1229
#define RD4PPS                        1230
#define RD5PPS                        1231
#define RD6PPS                        1232
#define RD7PPS                        1233
#define RE0PPS                        1234
#define RE1PPS                        1235
#define RE2PPS                        1236
#define CLCDATA                       1237
#define MCLC1OUT                      1238
#define MLC1OUT                       1239
#define MCLC2OUT                      1240
#define MLC2OUT                       1241
#define MLC3OUT                       1242
#define MCLC3OUT                      1243
#define MLC4OUT                       1244
#define MCLC4OUT                      1245
#define CLC1CON                       1246
#define CLC1CON_MODE                  1247
#define LC1MODE0                      1248
#define LC1MODE                       1249
#define CLC1CON_MODE0                 1250
#define LC1MODE1                      1251
#define CLC1CON_MODE1                 1252
#define CLC1CON_MODE2                 1253
#define LC1MODE2                      1254
#define LC1INTN                       1255
#define CLC1CON_INTN                  1256
#define LC1INTP                       1257
#define CLC1CON_INTP                  1258
#define CLC1CON_OUT                   1259
#define LC1OUT                        1260
#define LC1EN                         1261
#define CLC1CON_EN                    1262
#define CLC1POL                       1263
#define LC1G1POL                      1264
#define CLC1POL_G1POL                 1265
#define CLC1POL_G2POL                 1266
#define LC1G2POL                      1267
#define LC1G3POL                      1268
#define CLC1POL_G3POL                 1269
#define LC1G4POL                      1270
#define CLC1POL_G4POL                 1271
#define CLC1POL_POL                   1272
#define LC1POL                        1273
#define CLC1SEL0                      1274
#define CLC1SEL0_D1S0                 1275
#define LC1D1S                        1276
#define LC1D1S0                       1277
#define CLC1SEL0_D1S                  1278
#define CLC1SEL0_D1S1                 1279
#define LC1D1S1                       1280
#define CLC1SEL0_D1S2                 1281
#define LC1D1S2                       1282
#define CLC1SEL0_D1S3                 1283
#define LC1D1S3                       1284
#define CLC1SEL0_D1S4                 1285
#define LC1D1S4                       1286
#define CLC1SEL1                      1287
#define CLC1SEL1_D2S0                 1288
#define CLC1SEL1_D2S                  1289
#define LC1D2S                        1290
#define LC1D2S0                       1291
#define CLC1SEL1_D2S1                 1292
#define LC1D2S1                       1293
#define LC1D2S2                       1294
#define CLC1SEL1_D2S2                 1295
#define LC1D2S3                       1296
#define CLC1SEL1_D2S3                 1297
#define LC1D2S4                       1298
#define CLC1SEL1_D2S4                 1299
#define CLC1SEL2                      1300
#define LC1D3S0                       1301
#define CLC1SEL2_D3S                  1302
#define LC1D3S                        1303
#define CLC1SEL2_D3S0                 1304
#define LC1D3S1                       1305
#define CLC1SEL2_D3S1                 1306
#define LC1D3S2                       1307
#define CLC1SEL2_D3S2                 1308
#define LC1D3S3                       1309
#define CLC1SEL2_D3S3                 1310
#define LC1D3S4                       1311
#define CLC1SEL2_D3S4                 1312
#define CLC1SEL3                      1313
#define CLC1SEL3_D4S                  1314
#define LC1D4S                        1315
#define LC1D4S0                       1316
#define CLC1SEL3_D4S0                 1317
#define CLC1SEL3_D4S1                 1318
#define LC1D4S1                       1319
#define LC1D4S2                       1320
#define CLC1SEL3_D4S2                 1321
#define LC1D4S3                       1322
#define CLC1SEL3_D4S3                 1323
#define LC1D4S4                       1324
#define CLC1SEL3_D4S4                 1325
#define CLC1GLS0                      1326
#define CLC1GLS0_D1N                  1327
#define LC1G1D1N                      1328
#define CLC1GLS0_D1T                  1329
#define LC1G1D1T                      1330
#define LC1G1D2N                      1331
#define CLC1GLS0_D2N                  1332
#define LC1G1D2T                      1333
#define CLC1GLS0_D2T                  1334
#define CLC1GLS0_D3N                  1335
#define LC1G1D3N                      1336
#define CLC1GLS0_D3T                  1337
#define LC1G1D3T                      1338
#define CLC1GLS0_D4N                  1339
#define LC1G1D4N                      1340
#define CLC1GLS0_D4T                  1341
#define LC1G1D4T                      1342
#define CLC1GLS1                      1343
#define CLC1GLS1_D1N                  1344
#define LC1G2D1N                      1345
#define LC1G2D1T                      1346
#define CLC1GLS1_D1T                  1347
#define CLC1GLS1_D2N                  1348
#define LC1G2D2N                      1349
#define LC1G2D2T                      1350
#define CLC1GLS1_D2T                  1351
#define CLC1GLS1_D3N                  1352
#define LC1G2D3N                      1353
#define LC1G2D3T                      1354
#define CLC1GLS1_D3T                  1355
#define CLC1GLS1_D4N                  1356
#define LC1G2D4N                      1357
#define LC1G2D4T                      1358
#define CLC1GLS1_D4T                  1359
#define CLC1GLS2                      1360
#define CLC1GLS2_D1N                  1361
#define LC1G3D1N                      1362
#define LC1G3D1T                      1363
#define CLC1GLS2_D1T                  1364
#define LC1G3D2N                      1365
#define CLC1GLS2_D2N                  1366
#define LC1G3D2T                      1367
#define CLC1GLS2_D2T                  1368
#define CLC1GLS2_D3N                  1369
#define LC1G3D3N                      1370
#define LC1G3D3T                      1371
#define CLC1GLS2_D3T                  1372
#define LC1G3D4N                      1373
#define CLC1GLS2_D4N                  1374
#define LC1G3D4T                      1375
#define CLC1GLS2_D4T                  1376
#define CLC1GLS3                      1377
#define LC1G4D1N                      1378
#define CLC1GLS3_G4D1N                1379
#define LC1G4D1T                      1380
#define CLC1GLS3_G4D1T                1381
#define CLC1GLS3_G4D2N                1382
#define LC1G4D2N                      1383
#define CLC1GLS3_G4D2T                1384
#define LC1G4D2T                      1385
#define LC1G4D3N                      1386
#define CLC1GLS3_G4D3N                1387
#define LC1G4D3T                      1388
#define CLC1GLS3_G4D3T                1389
#define CLC1GLS3_G4D4N                1390
#define LC1G4D4N                      1391
#define CLC1GLS3_G4D4T                1392
#define LC1G4D4T                      1393
#define CLC2CON                       1394
#define LC2MODE0                      1395
#define CLC2CON_MODE                  1396
#define LC2MODE                       1397
#define CLC2CON_MODE0                 1398
#define LC2MODE1                      1399
#define CLC2CON_MODE1                 1400
#define LC2MODE2                      1401
#define CLC2CON_MODE2                 1402
#define LC2INTN                       1403
#define CLC2CON_INTN                  1404
#define LC2INTP                       1405
#define CLC2CON_INTP                  1406
#define CLC2CON_OUT                   1407
#define LC2OUT                        1408
#define CLC2CON_EN                    1409
#define LC2EN                         1410
#define CLC2POL                       1411
#define LC2G1POL                      1412
#define CLC2POL_G1POL                 1413
#define LC2G2POL                      1414
#define CLC2POL_G2POL                 1415
#define LC2G3POL                      1416
#define CLC2POL_G3POL                 1417
#define LC2G4POL                      1418
#define CLC2POL_G4POL                 1419
#define CLC2POL_POL                   1420
#define LC2POL                        1421
#define CLC2SEL0                      1422
#define CLC2SEL0_D1S                  1423
#define LC2D1S0                       1424
#define CLC2SEL0_D1S0                 1425
#define LC2D1S                        1426
#define LC2D1S1                       1427
#define CLC2SEL0_D1S1                 1428
#define LC2D1S2                       1429
#define CLC2SEL0_D1S2                 1430
#define CLC2SEL0_D1S3                 1431
#define LC2D1S3                       1432
#define LC2D1S4                       1433
#define CLC2SEL0_D1S4                 1434
#define CLC2SEL1                      1435
#define LC2D2S0                       1436
#define CLC2SEL1_D2S0                 1437
#define LC2D2S                        1438
#define CLC2SEL1_D2S                  1439
#define LC2D2S1                       1440
#define CLC2SEL1_D2S1                 1441
#define LC2D2S2                       1442
#define CLC2SEL1_D2S2                 1443
#define LC2D2S3                       1444
#define CLC2SEL1_D2S3                 1445
#define LC2D2S4                       1446
#define CLC2SEL1_D2S4                 1447
#define CLC2SEL2                      1448
#define CLC2SEL2_D3S                  1449
#define LC2D3S0                       1450
#define CLC2SEL2_D3S0                 1451
#define LC2D3S                        1452
#define CLC2SEL2_D3S1                 1453
#define LC2D3S1                       1454
#define LC2D3S2                       1455
#define CLC2SEL2_D3S2                 1456
#define LC2D3S3                       1457
#define CLC2SEL2_D3S3                 1458
#define LC2D3S4                       1459
#define CLC2SEL2_D3S4                 1460
#define CLC2SEL3                      1461
#define LC2D4S                        1462
#define LC2D4S0                       1463
#define CLC2SEL3_D4S                  1464
#define CLC2SEL3_D4S0                 1465
#define LC2D4S1                       1466
#define CLC2SEL3_D4S1                 1467
#define LC2D4S2                       1468
#define CLC2SEL3_D4S2                 1469
#define CLC2SEL3_D4S3                 1470
#define LC2D4S3                       1471
#define LC2D4S4                       1472
#define CLC2SEL3_D4S4                 1473
#define CLC2GLS0                      1474
#define LC2G1D1N                      1475
#define CLC2GLS0_D1N                  1476
#define CLC2GLS0_D1T                  1477
#define LC2G1D1T                      1478
#define LC2G1D2N                      1479
#define CLC2GLS0_D2N                  1480
#define CLC2GLS0_D2T                  1481
#define LC2G1D2T                      1482
#define LC2G1D3N                      1483
#define CLC2GLS0_D3N                  1484
#define CLC2GLS0_D3T                  1485
#define LC2G1D3T                      1486
#define LC2G1D4N                      1487
#define CLC2GLS0_D4N                  1488
#define CLC2GLS0_D4T                  1489
#define LC2G1D4T                      1490
#define CLC2GLS1                      1491
#define CLC2GLS1_D1N                  1492
#define LC2G2D1N                      1493
#define CLC2GLS1_D1T                  1494
#define LC2G2D1T                      1495
#define CLC2GLS1_D2N                  1496
#define LC2G2D2N                      1497
#define CLC2GLS1_D2T                  1498
#define LC2G2D2T                      1499
#define LC2G2D3N                      1500
#define CLC2GLS1_D3N                  1501
#define LC2G2D3T                      1502
#define CLC2GLS1_D3T                  1503
#define LC2G2D4N                      1504
#define CLC2GLS1_D4N                  1505
#define LC2G2D4T                      1506
#define CLC2GLS1_D4T                  1507
#define CLC2GLS2                      1508
#define LC2G3D1N                      1509
#define CLC2GLS2_D1N                  1510
#define CLC2GLS2_D1T                  1511
#define LC2G3D1T                      1512
#define CLC2GLS2_D2N                  1513
#define LC2G3D2N                      1514
#define LC2G3D2T                      1515
#define CLC2GLS2_D2T                  1516
#define CLC2GLS2_D3N                  1517
#define LC2G3D3N                      1518
#define CLC2GLS2_D3T                  1519
#define LC2G3D3T                      1520
#define CLC2GLS2_D4N                  1521
#define LC2G3D4N                      1522
#define LC2G3D4T                      1523
#define CLC2GLS2_D4T                  1524
#define CLC2GLS3                      1525
#define LC2G4D1N                      1526
#define CLC2GLS3_G4D1N                1527
#define CLC2GLS3_G4D1T                1528
#define LC2G4D1T                      1529
#define CLC2GLS3_G4D2N                1530
#define LC2G4D2N                      1531
#define LC2G4D2T                      1532
#define CLC2GLS3_G4D2T                1533
#define CLC2GLS3_G4D3N                1534
#define LC2G4D3N                      1535
#define CLC2GLS3_G4D3T                1536
#define LC2G4D3T                      1537
#define LC2G4D4N                      1538
#define CLC2GLS3_G4D4N                1539
#define CLC2GLS3_G4D4T                1540
#define LC2G4D4T                      1541
#define CLC3CON                       1542
#define LC3MODE0                      1543
#define CLC3CON_MODE0                 1544
#define CLC3CON_MODE                  1545
#define LC3MODE                       1546
#define LC3MODE1                      1547
#define CLC3CON_MODE1                 1548
#define LC3MODE2                      1549
#define CLC3CON_MODE2                 1550
#define LC3INTN                       1551
#define CLC3CON_INTN                  1552
#define CLC3CON_INTP                  1553
#define LC3INTP                       1554
#define CLC3CON_OUT                   1555
#define LC3OUT                        1556
#define LC3EN                         1557
#define CLC3CON_EN                    1558
#define CLC3POL                       1559
#define LC3G1POL                      1560
#define CLC3POL_G1POL                 1561
#define LC3G2POL                      1562
#define CLC3POL_G2POL                 1563
#define CLC3POL_G3POL                 1564
#define LC3G3POL                      1565
#define LC3G4POL                      1566
#define CLC3POL_G4POL                 1567
#define LC3POL                        1568
#define CLC3POL_POL                   1569
#define CLC3SEL0                      1570
#define CLC3SEL0_D1S0                 1571
#define LC3D1S0                       1572
#define LC3D1S                        1573
#define CLC3SEL0_D1S                  1574
#define LC3D1S1                       1575
#define CLC3SEL0_D1S1                 1576
#define LC3D1S2                       1577
#define CLC3SEL0_D1S2                 1578
#define LC3D1S3                       1579
#define CLC3SEL0_D1S3                 1580
#define LC3D1S4                       1581
#define CLC3SEL0_D1S4                 1582
#define CLC3SEL1                      1583
#define CLC3SEL1_D2S                  1584
#define CLC3SEL1_D2S0                 1585
#define LC3D2S                        1586
#define LC3D2S0                       1587
#define CLC3SEL1_D2S1                 1588
#define LC3D2S1                       1589
#define CLC3SEL1_D2S2                 1590
#define LC3D2S2                       1591
#define CLC3SEL1_D2S3                 1592
#define LC3D2S3                       1593
#define LC3D2S4                       1594
#define CLC3SEL1_D2S4                 1595
#define CLC3SEL2                      1596
#define CLC3SEL2_D3S0                 1597
#define LC3D3S                        1598
#define CLC3SEL2_D3S                  1599
#define LC3D3S0                       1600
#define LC3D3S1                       1601
#define CLC3SEL2_D3S1                 1602
#define LC3D3S2                       1603
#define CLC3SEL2_D3S2                 1604
#define LC3D3S3                       1605
#define CLC3SEL2_D3S3                 1606
#define LC3D3S4                       1607
#define CLC3SEL2_D3S4                 1608
#define CLC3SEL3                      1609
#define CLC3SEL3_D4S0                 1610
#define LC3D4S0                       1611
#define LC3D4S                        1612
#define CLC3SEL3_D4S                  1613
#define LC3D4S1                       1614
#define CLC3SEL3_D4S1                 1615
#define LC3D4S2                       1616
#define CLC3SEL3_D4S2                 1617
#define LC3D4S3                       1618
#define CLC3SEL3_D4S3                 1619
#define LC3D4S4                       1620
#define CLC3SEL3_D4S4                 1621
#define CLC3GLS0                      1622
#define CLC3GLS0_D1N                  1623
#define LC3G1D1N                      1624
#define LC3G1D1T                      1625
#define CLC3GLS0_D1T                  1626
#define LC3G1D2N                      1627
#define CLC3GLS0_D2N                  1628
#define CLC3GLS0_D2T                  1629
#define LC3G1D2T                      1630
#define CLC3GLS0_D3N                  1631
#define LC3G1D3N                      1632
#define LC3G1D3T                      1633
#define CLC3GLS0_D3T                  1634
#define CLC3GLS0_D4N                  1635
#define LC3G1D4N                      1636
#define CLC3GLS0_D4T                  1637
#define LC3G1D4T                      1638
#define CLC3GLS1                      1639
#define LC3G2D1N                      1640
#define CLC3GLS1_D1N                  1641
#define CLC3GLS1_D1T                  1642
#define LC3G2D1T                      1643
#define LC3G2D2N                      1644
#define CLC3GLS1_D2N                  1645
#define LC3G2D2T                      1646
#define CLC3GLS1_D2T                  1647
#define LC3G2D3N                      1648
